In [2]:
m <- matrix(c(90, 85, 90, 85, 96, 80, 69, 49, 70, 78, 95, 60), nrow=4, byrow=T)
m

     [,1] [,2] [,3]
[1,] 90   85   90
[2,] 85   96   80
[3,] 69   49   70
[4,] 78   95   60

In [3]:
rownames(m) <- c('John', 'Tom', 'Mark', 'Jane')
colnames(m) <- c('English', 'Math', 'Science')

In [4]:
m

     English Math Science
John 90      85   90
Tom  85      96   80
Mark 69      49   70
Jane 78      95   60

In [5]:
m <- data.frame(m)

In [6]:
m

     English Math Science
John 90      85   90
Tom  85      96   80
Mark 69      49   70
Jane 78      95   60

In [9]:
m['John', 'Math']

[1] 85

In [10]:
m['Tom', c('Science', 'Math')]

    Science Math
Tom 80      96

In [11]:
m['Mark', ]

     English Math Science
Mark 69      49   70

In [12]:
m[, 'English']

[1] 90 85 69 78

In [13]:
rownames(m)

[1] "John" "Tom"  "Mark" "Jane"

In [15]:
colnames(m)

[1] "English" "Math"    "Science"

In [16]:
colnames(m)[2]

[1] "Math"

In [20]:
brand <- c('M', 'L', 'B')
kcal <- c(514, 533, 566)
na <- c(917, 853, 888)
fat <- c(11, 13, 10)
burger <- data.frame(brand, kcal, na, fat)

In [21]:
burger

  brand kcal na  fat
1 M     514  917 11
2 L     533  853 13
3 B     566  888 10

In [22]:
colnames(burger) <- c('브랜드', '열량', '나트륨', '포화지방')

In [23]:
burger

  브랜드 열량 나트륨 포화지방
1 M      514  917    11
2 L      533  853    13
3 B      566  888    10

In [28]:
burger[burger['브랜드'] == 'M', '나트륨']

[1] 917

In [29]:
burger[burger['브랜드'] == 'M', ]

  브랜드 열량 나트륨 포화지방
1 M      514  917    11

In [31]:
burger['열량']

  열량
1 514
2 533
3 566